tsung/scripts/critical.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="35.164.234.80" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <!--<arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="16" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="6" duration="30" unit="second">
     <users arrivalrate="32" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="7" duration="30" unit="second">
     <users arrivalrate="64" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="8" duration="30" unit="second">
     <users arrivalrate="128" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="9" duration="30" unit="second">
     <users arrivalrate="256" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="10" duration="30" unit="second">
     <users arrivalrate="512" unit="second"></users>
   </arrivalphase>-->

  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
 

    <session name="news-session" probability="100" type="ts_http">

      <!-- start out at the dashboard. -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is looking at pictures -->
      <thinktime value="2" random="true"></thinktime>

      <!-- visit the news page, as a user would do.  -->
      <request>
        <http url='/news' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is viewing news-->
      <thinktime value="2" random="true"></thinktime>

      <!-- visit the news creation page.  -->
      <request>
        <http url='/news/new' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 10 seconds, user is filling out news creation form -->
      <thinktime value="10" random="true"></thinktime>

      

      
      <request>
                <dyn_variable name='authenticity_token'></dyn_variable>
                <http url='/news' version='1.1' method='GET'></http>
            </request>

            <setdynvars sourcetype="eval"
                        code='fun({Pid,DynVars})->
                                {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                                re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                <var name="authenticity_token" />
            </setdynvars> 

            <request subst="true">
        <dyn_variable name="created_news_id" re="[Ll]ocation: http://.*/news/(.*)\r"/>
                <http url='/news' method='POST' version='1.1' contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;news%5Bnewslink%5D=wef&amp;news%5Btitle%5D=awef&amp;news%5Bsubtext%5D=awef&amp;news%5Bimglink%5D=awef&amp;commit=Create+News" content_type="application/x-www-form-urlencoded"> </http>
            </request>

                  <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>
      


      

    </session>

  </sessions>
</tsung>